garyPenhook/PIC-Assembler/device_includes/pic16f17546.inc
// Register: DAC1CON
#define DAC1CON DAC1CON
DAC1CON                                  equ 088Ch
// bitfield definitions
DAC1CON_NSS_POSN                         equ 0000h
DAC1CON_NSS_POSITION                     equ 0000h
DAC1CON_NSS_SIZE                         equ 0001h
DAC1CON_NSS_LENGTH                       equ 0001h
DAC1CON_NSS_MASK                         equ 0001h
DAC1CON_PSS_POSN                         equ 0002h
DAC1CON_PSS_POSITION                     equ 0002h
DAC1CON_PSS_SIZE                         equ 0002h
DAC1CON_PSS_LENGTH                       equ 0002h
DAC1CON_PSS_MASK                         equ 000Ch
DAC1CON_OE_POSN                          equ 0004h
DAC1CON_OE_POSITION                      equ 0004h
DAC1CON_OE_SIZE                          equ 0002h
DAC1CON_OE_LENGTH                        equ 0002h
DAC1CON_OE_MASK                          equ 0030h
DAC1CON_REFRNG_POSN                      equ 0006h
DAC1CON_REFRNG_POSITION                  equ 0006h
DAC1CON_REFRNG_SIZE                      equ 0001h
DAC1CON_REFRNG_LENGTH                    equ 0001h
DAC1CON_REFRNG_MASK                      equ 0040h
DAC1CON_EN_POSN                          equ 0007h
DAC1CON_EN_POSITION                      equ 0007h
DAC1CON_EN_SIZE                          equ 0001h
DAC1CON_EN_LENGTH                        equ 0001h
DAC1CON_EN_MASK                          equ 0080h
DAC1CON_PSS0_POSN                        equ 0002h
DAC1CON_PSS0_POSITION                    equ 0002h
DAC1CON_PSS0_SIZE                        equ 0001h
DAC1CON_PSS0_LENGTH                      equ 0001h
DAC1CON_PSS0_MASK                        equ 0004h
DAC1CON_PSS1_POSN                        equ 0003h
DAC1CON_PSS1_POSITION                    equ 0003h
DAC1CON_PSS1_SIZE                        equ 0001h
DAC1CON_PSS1_LENGTH                      equ 0001h
DAC1CON_PSS1_MASK                        equ 0008h
DAC1CON_OE0_POSN                         equ 0004h
DAC1CON_OE0_POSITION                     equ 0004h
DAC1CON_OE0_SIZE                         equ 0001h
DAC1CON_OE0_LENGTH                       equ 0001h
DAC1CON_OE0_MASK                         equ 0010h
DAC1CON_OE1_POSN                         equ 0005h
DAC1CON_OE1_POSITION                     equ 0005h
DAC1CON_OE1_SIZE                         equ 0001h
DAC1CON_OE1_LENGTH                       equ 0001h
DAC1CON_OE1_MASK                         equ 0020h

// Register: DAC1DATL
#define DAC1DATL DAC1DATL
DAC1DATL                                 equ 088Dh
// bitfield definitions
DAC1DATL_DAC1R_POSN                      equ 0000h
DAC1DATL_DAC1R_POSITION                  equ 0000h
DAC1DATL_DAC1R_SIZE                      equ 0008h
DAC1DATL_DAC1R_LENGTH                    equ 0008h
DAC1DATL_DAC1R_MASK                      equ 00FFh
DAC1DATL_DAT_POSN                        equ 0000h
DAC1DATL_DAT_POSITION                    equ 0000h
DAC1DATL_DAT_SIZE                        equ 0008h
DAC1DATL_DAT_LENGTH                      equ 0008h
DAC1DATL_DAT_MASK                        equ 00FFh

// Register: DAC1DATH
#define DAC1DATH DAC1DATH
DAC1DATH                                 equ 088Eh
// bitfield definitions
DAC1DATH_DAC1R_POSN                      equ 0000h
DAC1DATH_DAC1R_POSITION                  equ 0000h
DAC1DATH_DAC1R_SIZE                      equ 0002h
DAC1DATH_DAC1R_LENGTH                    equ 0002h
DAC1DATH_DAC1R_MASK                      equ 0003h
DAC1DATH_DAT_POSN                        equ 0000h
DAC1DATH_DAT_POSITION                    equ 0000h
DAC1DATH_DAT_SIZE                        equ 0002h
DAC1DATH_DAT_LENGTH                      equ 0002h
DAC1DATH_DAT_MASK                        equ 0003h

// Register: DAC2CON
#define DAC2CON DAC2CON
DAC2CON                                  equ 0890h
// bitfield definitions
DAC2CON_NSS_POSN                         equ 0000h
DAC2CON_NSS_POSITION                     equ 0000h
DAC2CON_NSS_SIZE                         equ 0001h
DAC2CON_NSS_LENGTH                       equ 0001h
DAC2CON_NSS_MASK                         equ 0001h
DAC2CON_PSS_POSN                         equ 0002h
DAC2CON_PSS_POSITION                     equ 0002h
DAC2CON_PSS_SIZE                         equ 0002h
DAC2CON_PSS_LENGTH                       equ 0002h
DAC2CON_PSS_MASK                         equ 000Ch
DAC2CON_OE_POSN                          equ 0004h
DAC2CON_OE_POSITION                      equ 0004h
DAC2CON_OE_SIZE                          equ 0002h
DAC2CON_OE_LENGTH                        equ 0002h
DAC2CON_OE_MASK                          equ 0030h
DAC2CON_REFRNG_POSN                      equ 0006h
DAC2CON_REFRNG_POSITION                  equ 0006h
DAC2CON_REFRNG_SIZE                      equ 0001h
DAC2CON_REFRNG_LENGTH                    equ 0001h
DAC2CON_REFRNG_MASK                      equ 0040h
DAC2CON_EN_POSN                          equ 0007h
DAC2CON_EN_POSITION                      equ 0007h
DAC2CON_EN_SIZE                          equ 0001h
DAC2CON_EN_LENGTH                        equ 0001h
DAC2CON_EN_MASK                          equ 0080h
DAC2CON_PSS0_POSN                        equ 0002h
DAC2CON_PSS0_POSITION                    equ 0002h
DAC2CON_PSS0_SIZE                        equ 0001h
DAC2CON_PSS0_LENGTH                      equ 0001h
DAC2CON_PSS0_MASK                        equ 0004h
DAC2CON_PSS1_POSN                        equ 0003h
DAC2CON_PSS1_POSITION                    equ 0003h
DAC2CON_PSS1_SIZE                        equ 0001h
DAC2CON_PSS1_LENGTH                      equ 0001h
DAC2CON_PSS1_MASK                        equ 0008h
DAC2CON_OE0_POSN                         equ 0004h
DAC2CON_OE0_POSITION                     equ 0004h
DAC2CON_OE0_SIZE                         equ 0001h
DAC2CON_OE0_LENGTH                       equ 0001h
DAC2CON_OE0_MASK                         equ 0010h
DAC2CON_OE1_POSN                         equ 0005h
DAC2CON_OE1_POSITION                     equ 0005h
DAC2CON_OE1_SIZE                         equ 0001h
DAC2CON_OE1_LENGTH                       equ 0001h
DAC2CON_OE1_MASK                         equ 0020h

