garyPenhook/PIC-Assembler/device_includes/pic16f17546.inc
// Register: RB6I2C
#define RB6I2C RB6I2C
RB6I2C                                   equ 01EE7h
// bitfield definitions
RB6I2C_TH_POSN                           equ 0000h
RB6I2C_TH_POSITION                       equ 0000h
RB6I2C_TH_SIZE                           equ 0002h
RB6I2C_TH_LENGTH                         equ 0002h
RB6I2C_TH_MASK                           equ 0003h
RB6I2C_PU_POSN                           equ 0004h
RB6I2C_PU_POSITION                       equ 0004h
RB6I2C_PU_SIZE                           equ 0002h
RB6I2C_PU_LENGTH                         equ 0002h
RB6I2C_PU_MASK                           equ 0030h
RB6I2C_SLEW_POSN                         equ 0006h
RB6I2C_SLEW_POSITION                     equ 0006h
RB6I2C_SLEW_SIZE                         equ 0001h
RB6I2C_SLEW_LENGTH                       equ 0001h
RB6I2C_SLEW_MASK                         equ 0040h

// Register: RB7I2C
#define RB7I2C RB7I2C
RB7I2C                                   equ 01EE8h
// bitfield definitions
RB7I2C_TH_POSN                           equ 0000h
RB7I2C_TH_POSITION                       equ 0000h
RB7I2C_TH_SIZE                           equ 0002h
RB7I2C_TH_LENGTH                         equ 0002h
RB7I2C_TH_MASK                           equ 0003h
RB7I2C_PU_POSN                           equ 0004h
RB7I2C_PU_POSITION                       equ 0004h
RB7I2C_PU_SIZE                           equ 0002h
RB7I2C_PU_LENGTH                         equ 0002h
RB7I2C_PU_MASK                           equ 0030h
RB7I2C_SLEW_POSN                         equ 0006h
RB7I2C_SLEW_POSITION                     equ 0006h
RB7I2C_SLEW_SIZE                         equ 0001h
RB7I2C_SLEW_LENGTH                       equ 0001h
RB7I2C_SLEW_MASK                         equ 0040h

// Register: UMTOAP
#define UMTOAP UMTOAP
UMTOAP                                   equ 01F0Ch
// bitfield definitions
UMTOAP_UMTOAP_POSN                       equ 0000h
UMTOAP_UMTOAP_POSITION                   equ 0000h
UMTOAP_UMTOAP_SIZE                       equ 0008h
UMTOAP_UMTOAP_LENGTH                     equ 0008h
UMTOAP_UMTOAP_MASK                       equ 00FFh

// Register: UMTOAL
#define UMTOAL UMTOAL
UMTOAL                                   equ 01F0Dh
// bitfield definitions
UMTOAL_UMTOAL_POSN                       equ 0000h
UMTOAL_UMTOAL_POSITION                   equ 0000h
UMTOAL_UMTOAL_SIZE                       equ 0008h
UMTOAL_UMTOAL_LENGTH                     equ 0008h
UMTOAL_UMTOAL_MASK                       equ 00FFh

// Register: UMTOAH
#define UMTOAH UMTOAH
UMTOAH                                   equ 01F0Eh
// bitfield definitions
UMTOAH_UMTOAH_POSN                       equ 0000h
UMTOAH_UMTOAH_POSITION                   equ 0000h
UMTOAH_UMTOAH_SIZE                       equ 0008h
UMTOAH_UMTOAH_LENGTH                     equ 0008h
UMTOAH_UMTOAH_MASK                       equ 00FFh

// Register: PORTW
#define PORTW PORTW
PORTW                                    equ 01F22h
// bitfield definitions
PORTW_RW0_POSN                           equ 0000h
PORTW_RW0_POSITION                       equ 0000h
PORTW_RW0_SIZE                           equ 0001h
PORTW_RW0_LENGTH                         equ 0001h
PORTW_RW0_MASK                           equ 0001h
PORTW_RW1_POSN                           equ 0001h
PORTW_RW1_POSITION                       equ 0001h
PORTW_RW1_SIZE                           equ 0001h
PORTW_RW1_LENGTH                         equ 0001h
PORTW_RW1_MASK                           equ 0002h
PORTW_RW2_POSN                           equ 0002h
PORTW_RW2_POSITION                       equ 0002h
PORTW_RW2_SIZE                           equ 0001h
PORTW_RW2_LENGTH                         equ 0001h
PORTW_RW2_MASK                           equ 0004h
PORTW_RW3_POSN                           equ 0003h
PORTW_RW3_POSITION                       equ 0003h
PORTW_RW3_SIZE                           equ 0001h
PORTW_RW3_LENGTH                         equ 0001h
PORTW_RW3_MASK                           equ 0008h
PORTW_RW4_POSN                           equ 0004h
PORTW_RW4_POSITION                       equ 0004h
PORTW_RW4_SIZE                           equ 0001h
PORTW_RW4_LENGTH                         equ 0001h
PORTW_RW4_MASK                           equ 0010h
PORTW_RW5_POSN                           equ 0005h
PORTW_RW5_POSITION                       equ 0005h
PORTW_RW5_SIZE                           equ 0001h
PORTW_RW5_LENGTH                         equ 0001h
PORTW_RW5_MASK                           equ 0020h
PORTW_RW6_POSN                           equ 0006h
PORTW_RW6_POSITION                       equ 0006h
PORTW_RW6_SIZE                           equ 0001h
PORTW_RW6_LENGTH                         equ 0001h
PORTW_RW6_MASK                           equ 0040h
PORTW_RW7_POSN                           equ 0007h
PORTW_RW7_POSITION                       equ 0007h
PORTW_RW7_SIZE                           equ 0001h
PORTW_RW7_LENGTH                         equ 0001h
PORTW_RW7_MASK                           equ 0080h

// Register: LATW
#define LATW LATW
LATW                                     equ 01F23h
// bitfield definitions
LATW_LATW0_POSN                          equ 0000h
LATW_LATW0_POSITION                      equ 0000h
LATW_LATW0_SIZE                          equ 0001h
LATW_LATW0_LENGTH                        equ 0001h
LATW_LATW0_MASK                          equ 0001h
LATW_LATW1_POSN                          equ 0001h
LATW_LATW1_POSITION                      equ 0001h
LATW_LATW1_SIZE                          equ 0001h
LATW_LATW1_LENGTH                        equ 0001h
LATW_LATW1_MASK                          equ 0002h
LATW_LATW2_POSN                          equ 0002h
LATW_LATW2_POSITION                      equ 0002h
LATW_LATW2_SIZE                          equ 0001h
LATW_LATW2_LENGTH                        equ 0001h
LATW_LATW2_MASK                          equ 0004h
LATW_LATW3_POSN                          equ 0003h
LATW_LATW3_POSITION                      equ 0003h
LATW_LATW3_SIZE                          equ 0001h
LATW_LATW3_LENGTH                        equ 0001h
LATW_LATW3_MASK                          equ 0008h
LATW_LATW4_POSN                          equ 0004h
LATW_LATW4_POSITION                      equ 0004h
LATW_LATW4_SIZE                          equ 0001h
LATW_LATW4_LENGTH                        equ 0001h
LATW_LATW4_MASK                          equ 0010h
LATW_LATW5_POSN                          equ 0005h
LATW_LATW5_POSITION                      equ 0005h
LATW_LATW5_SIZE                          equ 0001h
LATW_LATW5_LENGTH                        equ 0001h
LATW_LATW5_MASK                          equ 0020h
LATW_LATW6_POSN                          equ 0006h
LATW_LATW6_POSITION                      equ 0006h
LATW_LATW6_SIZE                          equ 0001h
LATW_LATW6_LENGTH                        equ 0001h
LATW_LATW6_MASK                          equ 0040h
LATW_LATW7_POSN                          equ 0007h
LATW_LATW7_POSITION                      equ 0007h
LATW_LATW7_SIZE                          equ 0001h
LATW_LATW7_LENGTH                        equ 0001h
LATW_LATW7_MASK                          equ 0080h

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
PORTWIN0                                 equ 01F24h
// bitfield definitions
PORTWIN0_IN_POSN                         equ 0000h
PORTWIN0_IN_POSITION                     equ 0000h
PORTWIN0_IN_SIZE                         equ 0008h
PORTWIN0_IN_LENGTH                       equ 0008h
PORTWIN0_IN_MASK                         equ 00FFh
PORTWIN0_IN0_POSN                        equ 0000h
PORTWIN0_IN0_POSITION                    equ 0000h
PORTWIN0_IN0_SIZE                        equ 0001h
PORTWIN0_IN0_LENGTH                      equ 0001h
PORTWIN0_IN0_MASK                        equ 0001h
PORTWIN0_IN1_POSN                        equ 0001h
PORTWIN0_IN1_POSITION                    equ 0001h
PORTWIN0_IN1_SIZE                        equ 0001h
PORTWIN0_IN1_LENGTH                      equ 0001h
PORTWIN0_IN1_MASK                        equ 0002h
PORTWIN0_IN2_POSN                        equ 0002h
PORTWIN0_IN2_POSITION                    equ 0002h
PORTWIN0_IN2_SIZE                        equ 0001h
PORTWIN0_IN2_LENGTH                      equ 0001h
PORTWIN0_IN2_MASK                        equ 0004h
PORTWIN0_IN3_POSN                        equ 0003h
PORTWIN0_IN3_POSITION                    equ 0003h
PORTWIN0_IN3_SIZE                        equ 0001h
PORTWIN0_IN3_LENGTH                      equ 0001h
PORTWIN0_IN3_MASK                        equ 0008h

